/*Дано структуру даних (колекцію) відповідно до варіанта. Додати
зазначену кількість елементів, які описують відповідну предметну
область. Вивести всі елементи на консоль в прямому та зворотному
порядку. Вивести кількість елементів у колекції. Очистити колекцію.*/
using System;

class Program
{
    static void Main()
    {
        // Створюємо масив з 10 елементів
        string[] cities = { "Львiв", "Київ", "Харкiв", "Херсон", "Ужгород", "Суми", "Броди", "Миколаїв", "Рiвне", "Житомир" };

        // Виводимо всі елементи масиву в прямому порядку
        Console.WriteLine("Елементи масиву в прямому порядку:");
        foreach (string city in cities)
        {
            Console.WriteLine(city);
        }

        // Виконуємо зворотнє відображення масиву
        Array.Reverse(cities);

        // Виводимо всі елементи масиву в зворотному порядку
        Console.WriteLine("\nЕлементи масиву в зворотньому порядку:");
        foreach (string city in cities)
        {
            Console.WriteLine(city);
        }

        // Виводимо кількість елементів у масиві
        Console.WriteLine("\nКiлькiсть елементiв у масивi: " + cities.Length);

        // Очищаємо масив
        Array.Clear(cities, 0, cities.Length);

        
    }
}
